Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: 14 iabbrev teh the 15 iabbrev otehr other 16 iabbrev wnat want 17 iabbrev synchronisation 18 \ synchronization 19 let s:count = 4
es_es: 14 iabbrev csaa casa 15 iabbrev ootr otro 16 iabbrev qeu que 17 iabbrev sicronizacion 18 \ sincronización 19 let s:cuenta = 4

source: You will probably add new corrections to the plugin and soon have several versions laying around. And when distributing this file, people will want to know who wrote this wonderful plugin and where they can send remarks. Therefore, put a header at the top of your plugin: >
es_es: Lo más probable es que añada nuevas correcciones a la extensión, y tenga en poco tiempo varias versiones de ésta. Cuando distribuya el archivo, la gente querrá saber quién escribió esta maravillosa extensión, y dónde pueden enviar comentarios. Por ello, incluya un encabezado al principio de su extensión: >

source: 1 " Vim global plugin for correcting typing mistakes 2 " Last Change: 2000 Oct 15 3 " Maintainer: Bram Moolenaar <Bram@vim.org>
es_es: 1 " Extensión global de Vim para la corrección de errores 2 " Último cambio: 15 de octubre de 2000 3 " Desarrollador: Bram Moolenaar <Bram@vim.org>

source: About copyright and licensing: Since plugins are very useful and it's hardly worth restricting their distribution, please consider making your plugin either public domain or use the Vim |license|. A short note about this near the top of the plugin should be sufficient. Example: >
es_es: Derechos de autor y licencias: Debido a que las extensiones son útiles, y que no merece la pena restringir su distribución, considere que su extensión sea de dominio público, o use la licencia de Vim (|license|). Una breve nota cerca del inicio de la extensión debería servir. Ejemplo: >

source: 4 " License: This file is placed in the public domain.
es_es: 4 " Licencia: Este fichero pertenece al dominio público.

source: LINE CONTINUATION, AVOIDING SIDE EFFECTS *use-cpo-save*
es_es: CONTINUACIÓN DE LÍNEA, EVITAR EFECTOS SECUNDARIOS *use-cpo-save*

source: In line 18 above, the line-continuation mechanism is used |line-continuation|. Users with 'compatible' set will run into trouble here, they will get an error message. We can't just reset 'compatible', because that has a lot of side effects. To avoid this, we will set the 'cpoptions' option to its Vim default value and restore it later. That will allow the use of line-continuation and make the script work for most people. It is done like this: >
es_es: En la línea 18 del ejemplo anterior se usa el mecanismo |line-continuation|, continuación de línea. Los usuarios que definan 'compatible' pueden encontrar problemas con esto, y se les mostraría un mensaje de error. No podemos simplemente reiniciar 'compatible' porque tiene muchos efectos secundarios. Para evitarlo, definimos la opción 'cpoptions' con el valor predeterminado de Vim para restaurarlo más tarde. Esto permite el uso de «line-continuation» y que el script funcione en la mayoría de sistemas. Se hace de la siguiente forma: >

source: We first store the old value of 'cpoptions' in the s:save_cpo variable. At the end of the plugin this value is restored.
es_es: Primero almacenamos el valor antiguo de 'cpoptions' en la variable «s:save_cpo». El valor se restaurará al final de la extensión.

source: Notice that a script-local variable is used |s:var|. A global variable could already be in use for something else. Always use script-local variables for things that are only used in the script.
es_es: Tenga en cuenta que se usa una variable local de script, |s:var|. Puede que se esté utilizando una variable global para otra cosa. Use siempre variables locales en el script para aquello que se usa sólo en el script.

source: It's possible that a user doesn't always want to load this plugin. Or the system administrator has dropped it in the system-wide plugin directory, but a user has his own plugin he wants to use. Then the user must have a chance to disable loading this specific plugin. This will make it possible: >
es_es: Es posible que el usuario no desee cargar la extensión en cada momento. O que el administrador del sistema lo haya copiado al directorio de extensiones del sistema, pero el usuario quiere usar el suyo propio. En ese caso, el usuario debe tener la posibilidad de desactivar cargar esta extensión en particular. Lo siguiente lo hace posible: >

source: 6 if exists("g:loaded_typecorr") 7 finish 8 endif 9 let g:loaded_typecorr = 1
es_es: 6 if exists("g:loaded_correccort") 7 finish 8 endif 9 let g:loaded_correccort = 1

source: The name is recommended to start with "loaded_" and then the file name of the plugin, literally. The "g:" is prepended just to avoid mistakes when using the variable in a function (without "g:" it would be a variable local to the function).
es_es: Se recomienda que el nombre empiece con «loaded_» y, a continuación, el nombre literal de la extensión. La «g:» se añade para evitar errores al usar la variable en una función (sin la «g:», sería una variable local a la función).

source: Now let's make the plugin more interesting: We will add a mapping that adds a correction for the word under the cursor. We could just pick a key sequence for this mapping, but the user might already use it for something else. To allow the user to define which keys a mapping in a plugin uses, the <Leader> item can be used: >
es_es: Ahora, vamos a hacer que la extensión sea más interesante: vamos a añadir una macro que añade una corrección para la palabra bajo el cursor. Podríamos escoger una secuencia de teclas para esta macro, pero puede que el usuario la esté usando para otra cosa. Puede usar el elemento <Leader> para permitir que el usuario pueda definir las teclas que utiliza la macro de una extensión: >

source: 22 map <unique> <Leader>a <Plug>TypecorrAdd
es_es: 22 map <unique> <Leader>a <Plug>CorreccortAñadir

source: The user can set the "mapleader" variable to the key sequence that he wants this mapping to start with. Thus if the user has done: >
es_es: El usuario puede definir la variable «mapleader» con la secuencia de teclas con la que desea iniciar esta macro. Por lo tanto, si el usuario define: >

source: the mapping will define "_a". If the user didn't do this, the default value will be used, which is a backslash. Then a map for "\a" will be defined.
es_es: la macro se definirá como «_a». En caso contrario se usará el valor predeterminado, que es una barra inversa. Por ello, se definiría una macro como «\a».

source: Note that <unique> is used, this will cause an error message if the mapping already happened to exist. |:map-<unique>|
es_es: Tenga en cuenta se usa <unique>, lo que provocaría un mensaje de error si la macro ya existe. |:map-<unique>|

source: 21 if !hasmapto('<Plug>TypecorrAdd') 22 map <unique> <Leader>a <Plug>TypecorrAdd 23 endif
es_es: 21 if !hasmapto('<Plug>CorreccortAñadir') 22 map <unique> <Leader>a <Plug>CorreccortAñadir 23 endif

source: This checks if a mapping to "<Plug>TypecorrAdd" already exists, and only defines the mapping from "<Leader>a" if it doesn't. The user then has a chance of putting this in his vimrc file: >
es_es: Esto comprueba si ya existe una macro para «<Plug>CorrecortAñadir», y sólo define la macro de «<Leader>a» si no existe. Así, el usuario tiene la posibilidad de insertar esto en su archivo «vimrc»: >

source: map ,c <Plug>TypecorrAdd
es_es: map ,c <Plug>CorreccortAñadir

source: 30 function s:Add(from, correct) 31 let to = input("type the correction for " . a:from . ": ") 32 exe ":iabbrev " . a:from . " " . to .. 36 endfunction
es_es: 30 function s:Anadir(desde, correccion) 31 let a = input("Introduzca la corrección para " . a:desde . ": ") 32 exe ":iabbrev " . a:desde . " " . a .. 36 endfunction

source: Now we can call the function s:Add() from within this script. If another script also defines s:Add(), it will be local to that script and can only be called from the script it was defined in. There can also be a global Add() function (without the "s:"), which is again another function.
es_es: Ahora invocamos la función «s:Anadir()» desde el mismo script. Si otro script también define «s:Anadir()», será local a ese script y solo se invocará desde el script en el que se define. También puede existir una función global «Anadir()» (sin la «s:»), que es otra función distinta.

source: <SID> can be used with mappings. It generates a script ID, which identifies the current script. In our typing correction plugin we use it like this: >
es_es: Puede usar <SID> en una macro. Genera un identificador de script, que identifica al script actual. En nuestra extensión de corrección usaremos algo similar a esto: >

source: 24 noremap <unique> <script> <Plug>TypecorrAdd <SID>Add .. 28 noremap <SID>Add :call <SID>Add(expand("<cword>"), 1)<CR>
es_es: 24 noremap <unique> <script> <Plug>CorreccortAñadir <SID>Añadir .. 28 noremap <SID>Añadir :call <SID>Anadir(expand("<cword>"), 1)<CR>

source: \a -> <Plug>TypecorrAdd -> <SID>Add -> :call <SID>Add()
es_es: \a -> <Plug>CorreccortAñadir -> <SID>Añadir -> :call <SID>Anadir()

source: Note that instead of s:Add() we use <SID>Add() here. That is because the mapping is typed by the user, thus outside of the script. The <SID> is translated to the script ID, so that Vim knows in which script to look for the Add() function.
es_es: Tenga en cuenta que se usó «<SID>Anadir()» en lugar de «s:Anadir()» aquí. Eso es porque la macro es tecleada por el usuario, y por ello, se hace desde fuera del script. <SID> se expande al identificador del script, de forma que Vim sabe en qué script buscar la función «Anadir()».

source: This is a bit complicated, but it's required for the plugin to work together with other plugins. The basic rule is that you use <SID>Add() in mappings and s:Add() in other places (the script itself, autocommands, user commands).
es_es: Es un poco complicado, pero es necesario para que la extensión funcione adecuadamente con otras. La norma básica es que debe usar <SID>Anadir() en las macros y s:Anadir() en otros sitios (el mismo script, órdenes automáticas, órdenes de usuario).

source: 26 noremenu <script> Plugin.Add\ Correction <SID>Add
es_es: 26 noremenu <script> Plugin.Añadir\ Corrección <SID>Añadir

source: The "Plugin" menu is recommended for adding menu items for plugins. In this case only one item is used. When adding more items, creating a submenu is recommended. For example, "Plugin.CVS" could be used for a plugin that offers CVS operations "Plugin.CVS.checkin", "Plugin.CVS.checkout", etc.
es_es: Se recomienda el menú «Plugin» para añadir elementos de menú de extensiones. En este caso, sólo se usa un elemento. Recomendamos crear un menú secundario si añade más elementos. Por ejemplo, podría usar «Plugin.CVS» para una extensión que ofrezca operaciones CVS como «Plugin.CVS.checkin», «Plugin.CVS.checkout», etc.

source: <SID> AND <Plug> *using-<Plug>*
es_es: <SID> Y <Plug> *using-<Plug>*

source: Both <SID> and <Plug> are used to avoid that mappings of typed keys interfere with mappings that are only to be used from other mappings. Note the difference between using <SID> and <Plug>:
es_es: <SID> y <Plug> se usan para evitar que las macros de las teclas pulsadas interfieran con macros sólo usadas desde otras macros. Note la diferencia entre <SID> y <Plug>:

source: <Plug> is visible outside of the script. It is used for mappings which the user might want to map a key sequence to. <Plug> is a special code that a typed key will never produce. To make it very unlikely that other plugins use the same sequence of characters, use this structure: <Plug> scriptname mapname In our example the scriptname is "Typecorr" and the mapname is "Add". This results in "<Plug>TypecorrAdd". Only the first character of scriptname and mapname is uppercase, so that we can see where mapname starts.
es_es: <Plug> es visible fuera del script. Se usa para macros que el usuario pueda querer ligar a un secuencia de teclas. <Plug> es un código especial que una tecla nunca podrá producir. Para evitar que otras extensiones usen la misma secuencia de caracteres, use la estructura: <Plug> nombre-script nombre-macro En nuestro ejemplo, el nombre del script es «Correccort», y el nombre de la macro es «Añadir». El resultado es «<Plug>CorreccortAñadir». Solo el primer carácter de los nombres es mayúscula, facilitando ver el principio del nombre de la macro.

source: <SID> is the script ID, a unique identifier for a script. Internally Vim translates <SID> to "<SNR>123_", where "123" can be any number. Thus a function "<SID>Add()" will have a name "<SNR>11_Add()" in one script, and "<SNR>22_Add()" in another. You can see this if you use the ":function" command to get a list of functions. The translation of <SID> in mappings is exactly the same, that's how you can call a script-local function from a mapping.
es_es: <SID> es el identificador (ID) del script, un número único. Internamente, Vim traduce <SID> como «<SNR>123_», donde «123» puede ser cualquier número. Por ello, la función «<SID>Anadir()» tendría el nombre «<SNR>11_Anadir()» en un script, y «<SNR>22_Anadir()» en otro. Puede verlo si usa la orden «:function» para obtener la lista de funciones. La traducción de <SID> en las macros es idéntica, y así puede invocar una función local de un script mediante una macro.

source: 38 if !exists(":Correct") 39 command -nargs=1 Correct :call s:Add(<q-args>, 0) 40 endif
es_es: 38 if !exists(":Corregir") 39 command -nargs=1 Corregir :call s:Anadir(<q-args>, 0) 40 endif

source: The user command is defined only if no command with the same name already exists. Otherwise we would get an error here. Overriding the existing user command with ":command!" is not a good idea, this would probably make the user wonder why the command he defined himself doesn't work. |:command|
es_es: La orden de usuario se define únicamente si no existe una orden con el mismo nombre. En caso contrario, provocaría un error. Sobrescribir la orden de usuario existente con «:command!» no es una buena idea, ya que haría que el usuario se pregunte porqué no funciona la orden que ha definido. |:command|

source: The fun is that these variables can also be used in functions, autocommands and user commands that are defined in the script. In our example we can add a few lines to count the number of corrections: >
es_es: Lo interesante es que estas variables se pueden usar en funciones, órdenes automáticas y órdenes de usuario definidas en el script. En nuestro ejemplo, añadimos unas pocas líneas para contar el número de correcciones: >

source: 19 let s:count = 4 .. 30 function s:Add(from, correct) .. 34 let s:count = s:count + 1 35 echo s:count . " corrections now" 36 endfunction
es_es: 19 let s:cuenta = 4 .. 30 function s:Anadir(desde, correccion) .. 34 let s:cuenta = s:cuenta + 1 35 echo s:cuenta . " correcciones en este punto" 36 endfunction

source: First s:count is initialized to 4 in the script itself. When later the s:Add() function is called, it increments s:count. It doesn't matter from where the function was called, since it has been defined in the script, it will use the local variables from this script.
es_es: Al principio, «s:cuenta» se inicializa en el mismo script con un valor de 4. Al invocar la función «Anadir()» posteriormente, incrementa la variable «s:cuenta». No importa desde dónde se ha invocado la función, ya que está definida en el script, y usará las variables locales al script.

source: Line 33 wasn't explained yet. It applies the new correction to the word under the cursor. The |:normal| command is used to use the new abbreviation. Note that mappings and abbreviations are expanded here, even though the function was called from a mapping defined with ":noremap".
es_es: Aún no hemos explicado la línea 33. Aplica la nueva corrección a la palabra bajo el cursor. La orden |:normal| se emplea para usar la nueva abreviatura. Tenga en cuenta que aquí se expanden las macros y abreviaturas, a pesar de que la función se ha invocado desde una macro definida con «:noremap».

source: Using "unix" for the 'fileformat' option is recommended. The Vim scripts will then work everywhere. Scripts with 'fileformat' set to "dos" do not work on Unix. Also see |:source_crnl|. To be sure it is set right, do this before writing the file: >
es_es: Se recomienda usar «unix» como valor para la opción 'fileformat'. De esta forma, los scripts de Vim funcionarán en cualquier sistema. Los scripts con 'fileformat' definido como «dos» no funcionarán en Unix. También puede consultar |:source_crnl|. Para asegurar que hace lo correcto, haga lo siguiente antes de escribir el archivo: >

source: DOCUMENTATION *write-local-help*
es_es: DOCUMENTACIÓN *write-local-help*

source: 1 *typecorr.txt* Plugin for correcting typing mistakes 2 3 If you make typing mistakes, this plugin will have them corrected 4 automatically. 5 6 There are currently only a few corrections. Add your own if you like. 7 8 Mappings: 9 <Leader>a or <Plug>TypecorrAdd 10 Add a correction for the word under the cursor. 11 12 Commands: 13 :Correct {word} 14 Add a correction for {word}. 15 16 *typecorr-settings* 17 This plugin doesn't have any settings.
es_es: 1 *correcort.txt* Una extensión para corregir errores ortográficos 2 3 Esta extensión corrige automáticamente cualquier error ortográfico 4 que pueda escribir. 5 6 Solo hay unas pocas correcciones. Puede añadir las suyas. 7 8 Macros: 9 <Leader>a o <Plug>CorreccortAñadir 10 Añade una corrección para la palabra bajo el cursor. 11 12 Órdenes: 13 :Corregir {palabra} 14 Añade una corrección para {palabra}. 15 16 *correcort-opciones* 17 Esta extensión no tiene opciones de configuración.

source: The first line is actually the only one for which the format matters. It will be extracted from the help file to be put in the "LOCAL ADDITIONS:" section of help.txt |local-additions|. The first "*" must be in the first column of the first line. After adding your help file do ":help" and check that the entries line up nicely.
es_es: En realidad, la primera línea es la única en la que el formato importa. Se extraerá del archivo de ayuda para su ubicación en la sección «LOCAL ADDITIONS:» de help.txt |local-additions|. El primer asterisco debe estar en la primera columna de la primera línea. Ejecute «:help» después de añadir su archivo de ayuda y compruebe que las entradas están alineadas adecuadamente.

source: Using references to other parts of the help in || is recommended. This makes it easy for the user to find associated help.
es_es: Se recomienda utilizar referencias a otras partes de archivos de ayuda mediante barras, ||. Esto facilita que el usuario encuentre ayuda relacionada.

source: FILETYPE DETECTION *plugin-filetype*
es_es: EXTENSIÓN DE TIPO DE ARCHIVO *plugin-filetype*

source: If your filetype is not already detected by Vim, you should create a filetype detection snippet in a separate file. It is usually in the form of an autocommand that sets the filetype when the file name matches a pattern. Example: >
es_es: Si Vim no detecta su tipo de archivo, debería crear un fragmento de código de detección de tipo de archivo en un archivo separado. Habitualmente, tiene la forma de una orden automática que define el tipo de archivo cuando su nombre concuerda con un patrón. Ejemplo: >

source: Write this single-line file as "ftdetect/foofoo.vim" in the first directory that appears in 'runtimepath'. For Unix that would be "~/.vim/ftdetect/foofoo.vim". The convention is to use the name of the filetype for the script name.
es_es: Escriba este archivo de una sola línea como «ftdetect/foofoo.vim» en el primer directorio que aparece en su 'runtimepath'. En Unix, sería «~/.vim/ftdetect/foofoo.vim». La convención es nombrar el script como el nombre del tipo de archivo.

source: You can make more complicated checks if you like, for example to inspect the contents of the file to recognize the language. Also see |new-filetype|.
es_es: Si lo desea, puede hacer comprobaciones más complejas como inspeccionar los contenidos de un archivo para reconocer el tipo del mismo. Consulte también |new-filetype|.

source: SUMMARY *plugin-special*
es_es: RESUMEN *plugin-special*

source: s:name Variables local to the script.
es_es: s:nombre Variables locales al script.

source: <SID> Script-ID, used for mappings and functions local to the script.
es_es: <SID> El identificador del script (Script-ID), utilizado en macros y funciones locales al script.

source: hasmapto() Function to test if the user already defined a mapping for functionality the script offers.
es_es: hasmapto() Una función que comprueba si el usuario ya ha definido una macro para la funcionalidad que el script ofrece.

source: <Leader> Value of "mapleader", which the user defines as the keys that plugin mappings start with.
es_es: <Leader> El valor de «mapleader», que el usuario define como las teclas con las que iniciar las macros de extensiones.

source: :map <unique> Give a warning if a mapping already exists.
es_es: ::map <unique> Emite un aviso si la macro ya existe.

source: :noremap <script> Use only mappings local to the script, not global mappings.
es_es: :noremap <script> Sólo usa macros locales al script, no macros globales.

source: exists(":Cmd") Check if a user command already exists.
es_es: exists(":Orden") Comprueba la existencia de una orden de usuario.

source: *41.12* Writing a filetype plugin *write-filetype-plugin* *ftplugin*
es_es: *write-filetype-plugin* *ftplugin* *41.12* Escribir extensiones de tipo de archivo

source: A filetype plugin is like a global plugin, except that it sets options and defines mappings for the current buffer only. See |add-filetype-plugin| for how this type of plugin is used.
es_es: Una extensión de tipo de archivo («filetype plugin») es como una extensión global, a diferencia de que define opciones y macros que solo afectan al búfer local. Para saber más acerca del uso de este tipo de extensión, consulte |add-filetype-plugin|.

source: First read the section on global plugins above |41.11|. All that is said there also applies to filetype plugins. There are a few extras, which are explained here. The essential thing is that a filetype plugin should only have an effect on the current buffer.
es_es: En primer lugar, consulte la sección anterior sobre extensiones globales, |41.11|. Todo lo detallado ahí también afecta a las extensiones de tipo de archivo. Hay algunos elementos adicionales, que se explican aquí. Lo esencial es que una extensión de tipo de archivo sólo debe tener efecto en el búfer actual.

source: If you are writing a filetype plugin to be used by many people, they need a chance to disable loading it. Put this at the top of the plugin: >
es_es: Si esta escribiendo una extensión de tipo de archivo que mucha gente usará, necesitarán la capacidad de desactivar su carga. Inserte lo siguiente al principio de la extensión: >

source: " Only do this when not done yet for this buffer if exists("b:did_ftplugin") finish endif let b:did_ftplugin = 1
es_es: " Solo hace esto cuando aún no ha finalizado con este búfer if exists("b:did_ftplugin") finish endif let b:did_ftplugin = 1

source: Now write this in the "after" directory, so that it gets sourced after the distributed "vim.vim" ftplugin |after-directory|. For Unix this would be "~/.vim/after/ftplugin/vim.vim". Note that the default plugin will have set "b:did_ftplugin", but it is ignored here.
es_es: Escriba esto en el directorio «after», para que se lea después de la extensión de tipo de archivo predeterminado distribuido, «vim.vim» |after-directory|. En sistemas Unix, sería «~/.vim/after/ftplugin/vim.vim». Tenga en cuenta que la extensión predeterminada habrá definido «b:did_ftplugin», pero aquí se ignora.
